# RebarShapeMultiplanarDefinition Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeMultiplanarDefinition Methods
RebarShapeMultiplanarDefinition Class See Also
---
The RebarShapeMultiplanarDefinition type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetPresenceOfSegments | Simultaneously set the presence of all 3D segments. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
RebarShapeMultiplanarDefinition Class
Autodesk.Revit.DB.Structure Namespace